updated readme v2.0
